PaymentCreateAllISPC/results/20211007/BMPaymentV17/PAYCTFORDOMOUPSME_PaymentCreate20211007151903518.txt

Status: PASS
Time Taken: 1087
Size: 4610
Timestamp: Thu Oct 07 15:19:02 IST 2021
TestStep: PaymentCreate

----------------- Messages ------------------------------

----------------- Properties ------------------------------
Endpoint: http://10.246.89.109:20811/pin/services/PINSPayment_V1_7Service
Encoding: UTF-8

---------------- Request ---------------------------
Request Headers: SOAPAction : ""
Connection : Keep-Alive
User-Agent : Apache-HttpClient/4.5.2 (Java/16.0.1)
Host : 10.246.89.109:20811
Accept-Encoding : gzip,deflate
Content-Length : 7359
Content-Type : text/xml;charset=UTF-8


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsc="http://edb.com/ws/WSCommon_v21" xmlns:urn="urn:pins.payment.edb.com:ws:paymentinitiation:v1_7" xmlns:urn1="urn:pins.payment.edb.com:domain:paymentinitiation:v1_7" xmlns:urn2="urn:pays.payment.edb.com:domain:sepa-complex-types:v5" xmlns:urn3="urn:pays.payment.edb.com:domain:debtor:v1_5" xmlns:urn4="urn:pays.payment.edb.com:domain:creditor:v1_5">
   <soapenv:Header>
      <wsc:AutHeader>
         <wsc:SourceApplication>EVRYCPS</wsc:SourceApplication>
         <wsc:DestinationApplication>PIN</wsc:DestinationApplication>
         <wsc:Function>paymentAuthorizationCreate</wsc:Function>
         <wsc:Version>V1_7</wsc:Version>
         <wsc:ClientContext>
            <wsc:userid>55057203187</wsc:userid>
            <wsc:credentials>03111012010400425kbKcJMZoMF56OVtVL1neI9CfuAtjCBO603eS0IgWm1WWIO7EfpSL4DE/lDFi69n1sSaabKNt2t+xJppso23a37EmmmyjbdrfF3M0FKxtlD/HJbEkbc46/BMCstNp869esSaabKNt2t/XzlyjxYnxhcG46wcbIKp/sSaabKNt2t9wBUG0SyIoqFfig80Gq4uXVBtimDzTiu3EfQIWD5xMfslE2lt0gldZQIyIMvAwCMo=Owe13MJu4QRF5Vj5fdm42aK3nL6InZ7iUXQ2d3QvsDlp4SRrFo03WNE0BwBvlyk3Y5tHWP+DVGwZTtsKKiL4yr1VcsAzMmjub6dAdZ8J2NSTeOl14BcfV4hHDqgvdtQ6wTLSNlDSmdoQHUgDHgLgF/oRUnWDutHal9uw/ZEemPI=</wsc:credentials>
            <wsc:channel>BES</wsc:channel>
            <wsc:orgid>2544</wsc:orgid>
            <!--Optional:-->
            <wsc:orgunit>2544</wsc:orgunit>
            <!--Optional:-->
            <wsc:customerid>55057203187</wsc:customerid>
            <!--Optional:-->
            <wsc:locale>en</wsc:locale>
            <wsc:ip>1.1.1.1</wsc:ip>
            <!--Zero or more repetitions:-->
            <wsc:item key="TppId" value="1"/>
            <wsc:item key="TppName" value="ABC"/>
            <wsc:item key="PaymentChannel" value="BES"/>
            <wsc:item key="LogRef" value="2544bank"/>
            <wsc:item key="AgreementId" value="55057203187"/>
         </wsc:ClientContext>
      </wsc:AutHeader>
   </soapenv:Header>
   <soapenv:Body>
      <urn:PaymentCreateRequest>
         <urn:paymentMessage>
            <urn1:paymentIdentification>
               <urn2:messageIdentification>2526008</urn2:messageIdentification>
               <urn2:endToEndIdentification>PAYCTFORDOMOUPSME</urn2:endToEndIdentification>
               <!--Optional:-->
            </urn1:paymentIdentification>
            <urn1:paymentInfo>
               <urn3:paymentMethod>TRF</urn3:paymentMethod>
               <!--Optional:-->
               <urn3:paymentTypeInformation>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn3:instructionPriority>NORM</urn3:instructionPriority>
                  <urn3:categoryPurpose>SUPP</urn3:categoryPurpose>
               </urn3:paymentTypeInformation>
               <urn3:requestedExecutionDate>2021-10-07</urn3:requestedExecutionDate>
               <urn3:debtorAccount>
                  <urn2:identification>36281079039</urn2:identification>
                  <urn2:currency>NOK</urn2:currency>
                  <!--Optional:-->
               </urn3:debtorAccount>
               <!--Optional:-->
               <!--Optional:-->
               <urn3:debtorAgentBIC>SPAVNOBBXXX</urn3:debtorAgentBIC>
               <urn3:debtor>
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn2:name>debt</urn2:name>
                  <urn2:postalAddress>
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <!--Optional:-->
                     <urn2:addressType>ADDR</urn2:addressType>
                     <urn2:department>adfa</urn2:department>
                     <urn2:subDepartment>adfa</urn2:subDepartment>
                     <urn2:streetName>stret</urn2:streetName>
                     <urn2:buildingNumber>123</urn2:buildingNumber>
                     <urn2:postCode>7919</urn2:postCode>
                     <urn2:townName>teewne</urn2:townName>
                     <urn2:country>NO</urn2:country>
                     <!--0 to 7 repetitions:-->
                  </urn2:postalAddress>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
               </urn3:debtor>
               <!--Optional:-->
               <!--Optional:-->
            </urn1:paymentInfo>
            <urn1:transaction>
               <urn4:amount>
                  <!--You have a CHOICE of the next 2 items at this level-->
                  <urn2:instructedAmount currency="NOK">
                     <urn2:amount>1</urn2:amount>
                  </urn2:instructedAmount>
               </urn4:amount>
               <!--Optional:-->
               <!--Optional:-->
               <urn4:chargeBearer>SHAR</urn4:chargeBearer>
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <urn4:creditorAgent>
                  <urn2:bic>VEFONO21XXX</urn2:bic>
                  <urn2:postalAddress>
                     <urn2:addressType>ADDR</urn2:addressType>
                     <urn2:postCode>1122</urn2:postCode>
                     <urn2:country>NO</urn2:country>
                  </urn2:postalAddress>
               </urn4:creditorAgent>
               <urn4:creditor>
                  <!--Optional:-->
                  <!--Optional:-->
                  <urn2:name>After name</urn2:name>
                  <urn2:postalAddress>
                     <urn2:addressType>PBOX</urn2:addressType>
                     <urn2:buildingNumber>jjj</urn2:buildingNumber>
                     <urn2:postCode>11</urn2:postCode>
                     <urn2:country>NO</urn2:country>
                  </urn2:postalAddress>
                  <!--Optional:-->
                  <!--Optional:-->
                  <!--Optional:-->
               </urn4:creditor>
               <!--Optional:-->
               <urn4:creditorAccount>
                  <urn2:identification>24801016517</urn2:identification>
                  <urn2:currency>NOK</urn2:currency>
                  <!--Optional:-->
               </urn4:creditorAccount>
               <!--Optional:-->
               <!--Zero or more repetitions:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Optional:-->
               <!--Zero or more repetitions:-->
               <!--Optional:-->
            </urn1:transaction>
            <urn1:referredDocumentInformation>
               <urn2:type>CINV</urn2:type>
               <urn2:issuer>check CINV</urn2:issuer>
               <urn2:relatedDate>2021-10-07</urn2:relatedDate>
               <urn2:invoiceeOtherId>2910</urn2:invoiceeOtherId>
            </urn1:referredDocumentInformation>
            <urn1:autoConfirm>true</urn1:autoConfirm>
            <!--Optional:-->
            <!--Optional:-->
         </urn:paymentMessage>
      </urn:PaymentCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>

---------------- Response --------------------------
Response Headers: Transfer-Encoding : chunked
Server : Jetty(9.4.34.v20201102)
X-sorp : 55057203187;2544;55057203187;EVRYCPS;PIN;PINSPayment_V1_7.PaymentCreate;-;2544bank;0;0;false
#status# : HTTP/1.1 200 OK
Content-Type : text/xml;charset=utf-8


<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Body>
      <ns6:PaymentCreateResponse xmlns:ns10="urn:srv.pays.payment.fs.evry.com:ws:agreementcapture:v1_0" xmlns:ns9="urn:srv.stord.fs.evry.com:domain:common:v1" xmlns:ns8="urn:pays.payment.edb.com:domain:edb-types:v1" xmlns:ns7="urn:pays.payment.edb.com:domain:nationalinformation-nor:v1_0" xmlns:ns6="urn:pins.payment.edb.com:ws:paymentinitiation:v1_7" xmlns:ns5="urn:pays.payment.edb.com:domain:creditor:v1_5" xmlns:ns4="urn:pays.payment.edb.com:domain:sepa-complex-types:v5" xmlns:ns3="urn:pays.payment.edb.com:domain:debtor:v1_5" xmlns:ns2="urn:pins.payment.edb.com:domain:paymentinitiation:v1_7" xmlns="http://edb.com/ws/WSCommon_v21">
         <ns8:ResponseState>
            <ErrorCode>0</ErrorCode>
            <Severity>0</Severity>
            <ComponentId>111</ComponentId>
            <StrErrorCode xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <Message>OK</Message>
            <NativeError xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <LogSequence xsi:nil="true" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"/>
            <errorItem key="6456" value="A similar payment was recently added. Make sure it is not a mistake."/>
         </ns8:ResponseState>
         <ns6:paymentResult>
            <ns2:messageId>1025549</ns2:messageId>
            <ns2:paymentInfoId>1118998</ns2:paymentInfoId>
            <ns2:transactionId>260896964</ns2:transactionId>
            <ns2:initiatorIdentifier>55057203187</ns2:initiatorIdentifier>
            <ns2:paymentReference>260896964</ns2:paymentReference>
            <ns2:releaseDate>2021-10-07+02:00</ns2:releaseDate>
            <ns2:paymentType>FOREIGN_DOMESTIC_MESSAGE_STRUCT</ns2:paymentType>
            <ns2:paymentProduct>PI Domestic</ns2:paymentProduct>
            <ns2:transactionFee currency="NOK">
               <ns4:amount>5.00</ns4:amount>
            </ns2:transactionFee>
            <ns2:additionalServiceCharge>
               <ns4:serviceName>PI Foreign Account</ns4:serviceName>
               <ns4:charge currency="NOK">
                  <ns4:amount>3.00</ns4:amount>
               </ns4:charge>
            </ns2:additionalServiceCharge>
            <ns2:paymentIdentification>
               <ns4:messageIdentification>2526008</ns4:messageIdentification>
               <ns4:endToEndIdentification>PAYCTFORDOMOUPSME</ns4:endToEndIdentification>
            </ns2:paymentIdentification>
            <ns2:groupHeader>
               <ns4:creationDateTime>2021-10-07T11:49:02.345+02:00</ns4:creationDateTime>
            </ns2:groupHeader>
            <ns2:paymentInfo>
               <ns3:paymentMethod>TRF</ns3:paymentMethod>
               <ns3:paymentTypeInformation>
                  <ns3:instructionPriority>NORM</ns3:instructionPriority>
                  <ns3:categoryPurpose>SUPP</ns3:categoryPurpose>
               </ns3:paymentTypeInformation>
               <ns3:requestedExecutionDate>2021-10-07+02:00</ns3:requestedExecutionDate>
               <ns3:debtorAccount>
                  <ns4:identification>36281079039</ns4:identification>
                  <ns4:currency>NOK</ns4:currency>
               </ns3:debtorAccount>
               <ns3:debtorAgentBIC>SPAVNOBBXXX</ns3:debtorAgentBIC>
               <ns3:debtor>
                  <ns4:name>debt</ns4:name>
                  <ns4:postalAddress>
                     <ns4:addressType>ADDR</ns4:addressType>
                     <ns4:department>adfa</ns4:department>
                     <ns4:subDepartment>adfa</ns4:subDepartment>
                     <ns4:streetName>stret</ns4:streetName>
                     <ns4:buildingNumber>123</ns4:buildingNumber>
                     <ns4:postCode>7919</ns4:postCode>
                     <ns4:townName>teewne</ns4:townName>
                     <ns4:country>NO</ns4:country>
                  </ns4:postalAddress>
               </ns3:debtor>
            </ns2:paymentInfo>
            <ns2:transaction>
               <ns5:amount>
                  <ns4:instructedAmount currency="NOK">
                     <ns4:amount>1.00</ns4:amount>
                  </ns4:instructedAmount>
               </ns5:amount>
               <ns5:chargeBearer>SHAR</ns5:chargeBearer>
               <ns5:creditorAgent>
                  <ns4:bic>VEFONO21XXX</ns4:bic>
                  <ns4:nationalId>2544</ns4:nationalId>
                  <ns4:postalAddress>
                     <ns4:addressType>ADDR</ns4:addressType>
                     <ns4:postCode>1122</ns4:postCode>
                     <ns4:country>NO</ns4:country>
                  </ns4:postalAddress>
               </ns5:creditorAgent>
               <ns5:creditor>
                  <ns4:name>After name</ns4:name>
                  <ns4:postalAddress>
                     <ns4:addressType>PBOX</ns4:addressType>
                     <ns4:buildingNumber>jjj</ns4:buildingNumber>
                     <ns4:postCode>11</ns4:postCode>
                     <ns4:country>NO</ns4:country>
                  </ns4:postalAddress>
               </ns5:creditor>
               <ns5:creditorAccount>
                  <ns4:identification>24801016517</ns4:identification>
                  <ns4:currency>NOK</ns4:currency>
               </ns5:creditorAccount>
               <ns5:confidential>false</ns5:confidential>
               <ns2:remittanceInformation>
                  <ns4:remittanceInformationStructured>
                     <ns4:referredDocumentInformation>
                        <ns4:type>CINV</ns4:type>
                        <ns4:issuer>check CINV</ns4:issuer>
                        <ns4:relatedDate>2021-10-07+02:00</ns4:relatedDate>
                        <ns4:invoiceeOtherId>2910</ns4:invoiceeOtherId>
                     </ns4:referredDocumentInformation>
                  </ns4:remittanceInformationStructured>
               </ns2:remittanceInformation>
            </ns2:transaction>
            <ns2:referredDocumentInformation>
               <ns4:type>CINV</ns4:type>
               <ns4:issuer>check CINV</ns4:issuer>
               <ns4:relatedDate>2021-10-07+02:00</ns4:relatedDate>
               <ns4:invoiceeOtherId>2910</ns4:invoiceeOtherId>
            </ns2:referredDocumentInformation>
            <ns2:marketType>BM</ns2:marketType>
         </ns6:paymentResult>
      </ns6:PaymentCreateResponse>
   </soap:Body>
</soap:Envelope>
